Ran Plan for 2 projects:

1. project: `sumologic/collector` dir: `sumologic/collector` workspace: `default`
1. project: `sumologic/sources/vpcflow` dir: `sumologic/sources/vpcflow` workspace: `default`

### 1. project: `sumologic/collector` dir: `sumologic/collector` workspace: `default`
```diff
sumologic_collector.vpcflowlog: Refreshing state... [id=100055558]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p sumologic/collector`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.terraform.devart.tv/lock?id=DevopsArtFactory%252Fterraform-provisioning%252Fsumologic%252Fcollector%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p sumologic/collector`

---
### 2. project: `sumologic/sources/vpcflow` dir: `sumologic/sources/vpcflow` workspace: `default`
<details><summary>Show Output</summary>

```diff
data.terraform_remote_state.sumologic_collector: Reading...
data.terraform_remote_state.sumologic_collector: Read complete after 0s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # sumologic_s3_source.vpcflow_source["zerone-id_ap-northeast-2"] will be created
+ resource "sumologic_s3_source" "vpcflow_source" {
      + automatic_date_parsing       = true
      + category                     = "vpcflow/zerone-id/ap-northeast-2"
      + collector_id                 = 100055558
      + content_type                 = "AwsS3Bucket"
      + cutoff_timestamp             = 0
      + description                  = "network traffic data in AWS VPCs for traffic analysis"
      + fields                       = {
          + "account_alias" = "zerone-id"
          + "account_id"    = "066346343248"
        }
      + force_timezone               = false
      + id                           = (known after apply)
      + multiline_processing_enabled = true
      + name                         = "vpcflow-zerone-id-apnortheast2"
      + paused                       = false
      + scan_interval                = 300000
      + url                          = (known after apply)
      + use_autoline_matching        = true

      + authentication {
          + region   = "ap-northeast-2"
          + role_arn = "arn:aws:iam::066346343248:role/sumologic-role"
          + type     = "AWSRoleBasedAuthentication"
        }

      + path {
          + bucket_name                   = "tmcdapne2-vpcflow-log"
          + path_expression               = "AWSLogs/066346343248/vpcflowlogs/ap-northeast-2/*"
          + sns_topic_or_subscription_arn = (known after apply)
          + type                          = "S3BucketPathExpression"
          + use_versioned_api             = true
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p sumologic/sources/vpcflow`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.terraform.devart.tv/lock?id=DevopsArtFactory%252Fterraform-provisioning%252Fsumologic%252Fsources%252Fvpcflow%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p sumologic/sources/vpcflow`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
